{"guid": "N05_001", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "tree", "concept_definition": "A perennial woody plant typically having a single main stem or trunk, supporting branches and leaves and growing to a considerable height.", "difficulty_level": 8}
{"guid": "N05_002", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "flower", "concept_definition": "the seed-bearing part of a flowering plant, consisting of reproductive structures (stamens and pistils) often surrounded by colorful petals", "difficulty_level": 8}
{"guid": "N05_003", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "grass", "concept_definition": "the green, often short plants with narrow leaves that grow widely on lawns and fields; the vegetation forming a turf", "difficulty_level": 8}
{"guid": "N05_004", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "leaf", "concept_definition": "a flat, typically green plant organ attached to a stem or branch, where photosynthesis and gas exchange occur", "difficulty_level": 8}
{"guid": "N05_005", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "garden", "concept_definition": "a plot of ground, often near a house, used for growing flowers, vegetables, or ornamental plants; a planned outdoor area cultivated for aesthetic or productive purposes", "difficulty_level": 8}
{"guid": "N05_006", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "park", "concept_definition": "an area of land, often owned by a city or public authority, set aside and maintained for public recreation, open space, and enjoyment (often with lawns, trees, paths, and playgrounds)", "difficulty_level": 8}
{"guid": "N05_007", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "oak", "concept_definition": "A type of tree known for its strength and durability, often producing acorns and used for timber.", "difficulty_level": 8, "notes": "Oaks are commonly found in temperate regions and are valued for their wood and ecological importance."}
{"guid": "N05_008", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "rose", "concept_definition": "A rose is a type of flowering plant known for its beautiful blooms and often sweet fragrance, commonly associated with love and beauty.", "difficulty_level": 8, "notes": "Roses are popular in gardens and as cut flowers, often given as gifts."}
{"guid": "N05_009", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "root", "concept_definition": "The part of a plant that typically grows underground, anchoring the plant and absorbing water and nutrients from the soil.", "difficulty_level": 15, "notes": "This entry covers the botanical meaning of 'root' corresponding to Lithuanian 'šaknis'. 'Root' has other senses (e.g., mathematical root, origin) that are not included here."}
{"guid": "N05_010", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "branch", "concept_definition": "A woody limb that grows from the trunk or stem of a tree or shrub.", "difficulty_level": 15, "notes": "This analysis focuses on the botanical meaning of 'branch' (Lithuanian 'šaka'). 'Branch' can have other senses (e.g., organizational branch) which are not covered here."}
{"guid": "N05_011", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "seed", "concept_definition": "A small reproductive unit produced by a plant that can grow into a new plant.", "difficulty_level": 15, "notes": "Refers specifically to the botanical reproductive structure (not figurative uses like 'seed' as origin or computing terms). All translations are in singular/base form."}
{"guid": "N05_012", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "fruit", "concept_definition": "The edible reproductive body of a seed plant, typically sweet or sour, eaten as food (singular, base form).", "difficulty_level": 15, "notes": "Refers to the botanical/culinary primary meaning (edible plant product). Does not cover figurative senses (e.g., 'fruit of labor')."}
{"guid": "N05_013", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "forest", "concept_definition": "A large area covered chiefly with trees and undergrowth; a woodland ecosystem.", "difficulty_level": 15, "notes": "Refers to a natural area dominated by trees (not figurative uses like 'the forest of regulations'). Translations are singular/base forms."}
{"guid": "N05_014", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "weed", "concept_definition": "A wild plant that grows where it is not wanted, often among cultivated plants or in gardens.", "difficulty_level": -1, "notes": "This entry covers the common botanical sense of 'weed' (piktžolė). Other senses (e.g., cannabis or verb 'to weed') are excluded per instructions."}
{"guid": "N05_015", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "bark", "concept_definition": "The tough outer covering of a tree trunk and branches.", "difficulty_level": 15, "notes": "This entry treats 'bark' in the sense of tree bark (Lithuanian 'žievė'), not the animal vocalization or ship's deck."}
{"guid": "N05_016", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "pollen", "concept_definition": "Fine powder produced by flowering plants that contains male reproductive cells and can fertilize other plants; often dispersed by wind or animals.", "difficulty_level": 15, "notes": "Lithuanian singular lemma is žiedadulkė (plural žiedadulkės). Subtype 'natural_feature' or 'plant_reproductive_part' applicable; chosen 'natural_feature' to fit provided subtype list. Translations given in base/lemma forms."}
{"guid": "N05_017", "pos_type": "noun", "pos_subtype": "plant", "concept_label": "trunk", "concept_definition": "The main woody stem of a tree that supports branches and transports nutrients and water.", "difficulty_level": 15, "notes": "This analysis covers the botanical sense of 'trunk' (Lithuanian kamienas). 'Trunk' has other meanings (e.g., luggage, car storage) which are not included per instructions."}
