{"guid": "N29_001", "pos_type": "noun", "pos_subtype": "personal_name", "concept_label": "Europe", "concept_definition": "a continent comprising the westernmost part of Eurasia, bordered by the Arctic Ocean to the north, the Atlantic Ocean to the west, the Mediterranean Sea to the south, and Asia to the east; includes countries such as Germany, France, Italy, and Russia (the portion west of the Ural Mountains).", "difficulty_level": 14}
{"guid": "N29_002", "pos_type": "noun", "pos_subtype": "personal_name", "concept_label": "Asia", "concept_definition": "a vast continent in the Eastern and Northern Hemispheres, comprising countries such as China, India, Japan, and Russia; the largest and most populous continent on Earth.", "difficulty_level": 14}
{"guid": "N29_003", "pos_type": "noun", "pos_subtype": "personal_name", "concept_label": "Africa", "concept_definition": "the world's second-largest continent, located mainly in the Eastern Hemisphere and bordered by the Mediterranean Sea to the north, the Atlantic Ocean to the west, the Indian Ocean to the southeast; comprising about 54 countries and diverse cultures, climates, and ecosystems", "difficulty_level": 14}
{"guid": "N29_004", "pos_type": "noun", "pos_subtype": "personal_name", "concept_label": "North America", "concept_definition": "The continent in the Northern Hemisphere comprising the countries of Canada, the United States, Mexico, Central American nations, and the Caribbean islands.", "difficulty_level": 19}
{"guid": "N29_005", "pos_type": "noun", "pos_subtype": "personal_name", "concept_label": "South America", "concept_definition": "The continent in the Western Hemisphere located mostly in the Southern Hemisphere, bounded by the Caribbean Sea to the north, the Atlantic Ocean to the east, the Pacific Ocean to the west, and connected to North America by the Isthmus of Panama; includes countries such as Brazil, Argentina, Colombia, and Chile.", "difficulty_level": 19}
{"guid": "N29_006", "pos_type": "noun", "pos_subtype": "personal_name", "concept_label": "Atlantic Ocean", "concept_definition": "the vast body of salt water separating the continents of North and South America on the west from Europe and Africa on the east; the second-largest of the world’s oceans", "difficulty_level": 19}
{"guid": "N29_007", "pos_type": "noun", "pos_subtype": "personal_name", "concept_label": "Pacific Ocean", "concept_definition": "the largest of Earth’s oceans, separating Asia and Australia from the Americas and covering about one-third of the planet’s surface; characterized by its vast size and generally calm waters", "difficulty_level": 19}
{"guid": "N29_008", "pos_type": "noun", "pos_subtype": "personal_name", "concept_label": "Baltic Sea", "concept_definition": "a large marginal sea of the Atlantic Ocean in Northern Europe, bordered by Sweden, Finland, Russia, Estonia, Latvia, Lithuania, Poland, Germany, and Denmark", "difficulty_level": 19}
{"guid": "N29_009", "pos_type": "noun", "pos_subtype": "personal_name", "concept_label": "Mediterranean Sea", "concept_definition": "The sea connected to the Atlantic Ocean between southern Europe, North Africa, and the Near East; bounded by Spain, France, Italy, Greece, Turkey, and the North African countries (commonly called the Mediterranean).", "difficulty_level": 19}
{"guid": "N29_010", "pos_type": "noun", "pos_subtype": "personal_name", "concept_label": "Christmas", "concept_definition": "the annual Christian and cultural festival, celebrated on December 25, commemorating the birth of Jesus Christ; also used for the holiday season around that date", "difficulty_level": 14}
{"guid": "N29_011", "pos_type": "noun", "pos_subtype": "personal_name", "concept_label": "Easter", "concept_definition": "The Christian festival commemorating the resurrection of Jesus Christ, observed on a Sunday in spring; also used for various related religious services and public holidays. (Also used as a proper noun in names like Easter Monday.)", "difficulty_level": 14}
{"guid": "N29_012", "pos_type": "noun", "pos_subtype": "personal_name", "concept_label": "New Year", "concept_definition": "The first day of the calendar year (January 1) or the period around the start of the calendar year, often celebrated with traditions and festivities.", "difficulty_level": 19}
{"guid": "N29_013", "pos_type": "noun", "pos_subtype": "personal_name", "concept_label": "Independence Day", "concept_definition": "a public holiday commemorating the anniversary of a country's declaration or achievement of independence from foreign rule or control", "difficulty_level": 19}
