{"guid": "N02_001", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "dog", "concept_definition": "A domesticated canine animal (Canis familiaris) kept as a pet, for companionship, or for work such as guarding or herding.", "difficulty_level": 2, "notes": "[2025-08-12 20:47] Updated with gpt-5-nano"}
{"guid": "N02_002", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "cat", "concept_definition": "A small domesticated carnivorous mammal kept as a pet or for catching mice, typically with soft fur, a short snout, and retractile claws.", "difficulty_level": 2, "notes": "[2025-08-30 16:12] Updated with gpt-5-mini: Refers to the common domestic cat (Felis catus). Does not cover other senses such as 'cat' in machinery (e.g., caterpillar) or metaphorical uses."}
{"guid": "N02_003", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "bird", "concept_definition": "A warm-blooded, egg-laying vertebrate with feathers, wings, and usually the ability to fly; members of class Aves.", "difficulty_level": 2, "notes": "[2025-08-30 16:13] Updated with gpt-5-mini: Refers to the general animal 'bird' (class Aves). Does not cover figurative or idiomatic uses (e.g., 'birds of a feather') or specific species names."}
{"guid": "N02_004", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "horse", "concept_definition": "A large domesticated mammal with a mane and tail, used for riding, racing, or pulling loads.", "difficulty_level": 2, "notes": "[2025-08-12 20:46] Updated with gpt-5-nano"}
{"guid": "N02_005", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "cow", "concept_definition": "A large domesticated female bovine raised for milk, meat, or as livestock.", "difficulty_level": 2, "notes": "[2025-08-30 16:13] Updated with gpt-5-mini: Refers to the adult female of cattle species (Bos taurus). Does not include male forms such as 'bull' or general 'cattle' (Lithuanian: galvijai)."}
{"guid": "N02_006", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "pig", "concept_definition": "A domesticated hoofed mammal raised for meat (pork) and other products; typically Sus scrofa domesticus.", "difficulty_level": 2, "notes": "[2025-08-30 16:13] Updated with gpt-5-mini: Analysis targets the common domesticated farm animal meaning. Alternatives list related English and Lithuanian lemmas (kiauliai is plural lemma form often used colloquially; šernas = wild boar)."}
{"guid": "N02_007", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "chicken", "concept_definition": "a domesticated fowl (Gallus gallus domesticus) kept for its eggs and meat; an adult female is specifically called a hen", "difficulty_level": 2}
{"guid": "N02_008", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "mouse (animal)", "concept_definition": "A small rodent with a pointed snout, rounded ears, and a long tail, typically living in or near human dwellings; (informal) a timid or quiet person; (computing) a handheld device used to control a cursor on a computer screen.", "difficulty_level": 2}
{"guid": "N02_009", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "bear", "concept_definition": "A large mammal with a thick fur coat, a bulky body, and a short tail, living in forests or mountains. Bears are omnivores and may hibernate in winter.", "difficulty_level": 2, "notes": "[2025-08-12 20:46] Updated with gpt-5-nano"}
{"guid": "N02_010", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "wolf", "concept_definition": "a large carnivorous mammal (Canis lupus) of the dog family, typically living and hunting in packs and found in wild habitats across the Northern Hemisphere", "difficulty_level": 2}
{"guid": "N02_011", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "rabbit", "concept_definition": "A small mammal with long ears, soft fur, and a short tail, often kept as a pet or found in the wild.", "difficulty_level": 9, "notes": "Commonly refers to the small mammal known for its long ears and hopping movement."}
{"guid": "N02_012", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "whale", "concept_definition": "A large marine mammal that lives in the ocean and is known for its size and singing sounds.", "difficulty_level": 9, "notes": "'Whale' refers specifically to the large marine mammals of the order Cetacea. The Lithuanian term 'banginis' is the standard translation."}
{"guid": "N02_013", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "tiger", "concept_definition": "A large wild cat with orange fur and black stripes, known for its strength and agility.", "difficulty_level": 9, "notes": "A common wild feline found in Asia, recognized for its distinctive striped coat."}
{"guid": "N02_014", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "snake", "concept_definition": "A snake is a long, legless reptile that moves by slithering and often has scales.", "difficulty_level": 9, "notes": "Commonly refers to the legless reptile. No significant alternative forms."}
{"guid": "N02_015", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "elephant", "concept_definition": "A very large gray mammal with a long trunk and tusks; native to Africa and Asia.", "difficulty_level": 9, "notes": "Common noun for the large herbivorous mammal. Base form; no plural or variant meanings included."}
{"guid": "N02_016", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "shark", "concept_definition": "A large sea fish with a skeleton made of cartilage; a predator known for its sharp teeth.", "difficulty_level": 9, "notes": "Base form analysis focused on the animal noun; singular in Lithuanian is 'ryklis'. Swahili translation provided as general 'samaki' (fish) when a precise term for 'shark' is not universally standardized in all dialects."}
{"guid": "N02_017", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "owl", "concept_definition": "A nocturnal bird of prey with a flat face and large forward-facing eyes, known for hunting at night and often symbolizing wisdom.", "difficulty_level": 15, "notes": "Refers to the common meaning of the bird (Strigiformes). Lithuanian 'pelėda' is the general term for owl; some species names differ (e.g., 'pelėda didžioji' = great horned owl)."}
{"guid": "N02_018", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "spider", "concept_definition": "A small arthropod with eight legs that often spins webs to catch insects.", "difficulty_level": 15, "notes": "Refers to the common arachnid (order Araneae). Avoid metaphorical uses (e.g., 'spider' as a web crawler) if meaning differs; provided Lithuanian 'voras' matches the biological animal sense."}
{"guid": "N02_019", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "squirrel", "concept_definition": "A small to medium-sized rodent with a bushy tail, typically living in trees and feeding on nuts and seeds.", "difficulty_level": 15, "notes": "Refers to tree-dwelling or ground-dwelling rodents of the family Sciuridae; term used in general/common sense matching Lithuanian 'voverė' (tree squirrel)."}
{"guid": "N02_020", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "goat", "concept_definition": "A small to medium-sized hoofed mammal (Capra aegagrus hircus) kept for milk, meat, fiber, or as a domestic farm animal.", "difficulty_level": 15, "notes": "Here 'goat' refers to the common domestic female or general goat concept; Lithuanian 'ožka' is typically female goat, while 'ožys' denotes a male (gander/goat) or can be used generically in some contexts."}
{"guid": "N02_021", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "goose", "concept_definition": "A large waterfowl with a long neck, webbed feet, and a flat bill, commonly kept domestically or found wild (singular).", "difficulty_level": 15, "notes": "Refers to the bird species (female or general singular); the male is 'gander' (English) and in Lithuanian 'gansas' (not requested as main lemma). All forms given as base/lemma."}
{"guid": "N02_022", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "duck", "concept_definition": "A waterbird with a broad body, short legs, a flat bill, and webbed feet, commonly found in ponds, lakes, and rivers.", "difficulty_level": 15, "notes": "This entry covers the noun meaning 'duck' as the bird (Lithuanian 'antis'). Does not cover the verb sense 'to duck' (to lower the head/body)."}
{"guid": "N02_023", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "frog", "concept_definition": "A small tailless amphibian with a short body, long hind legs for jumping, smooth moist skin, and bulging eyes, typically living near water.", "difficulty_level": 15, "notes": "Analyzed as the common amphibian meaning (Lithuanian 'varlė'). Alternative Lithuanian form given is genitive/singular or colloquial; base form is 'varlė'."}
{"guid": "N02_024", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "butterfly", "concept_definition": "A flying insect with two pairs of large, often colorful wings and a slender body; undergoes metamorphosis from caterpillar to adult.", "difficulty_level": 15, "notes": "Refers to the insect (not metaphorical uses like 'butterflies in the stomach'). All forms given are base (singular/lemma)."}
{"guid": "N02_025", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "turtle", "concept_definition": "A reptile with a hard shell covering its body, typically living in water or on land and able to retract its head and legs into its shell.", "difficulty_level": 15, "notes": "This entry refers to the common meaning 'turtle' as a shelled reptile (Lithuanian 'vėžlys'). Does not cover metaphorical or regional senses (e.g., 'tortoise' vs. 'sea turtle' distinctions)."}
{"guid": "N02_026", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "crow", "concept_definition": "A medium- to large-sized passerine bird of the genus Corvus, with glossy black plumage, a strong stout bill, and a loud harsh \"caw\" call; known for high intelligence and adaptable omnivorous feeding habits.", "difficulty_level": 15, "notes": "This entry refers specifically to the bird (genus Corvus) commonly called 'crow' in English. Do not confuse with the verb 'to crow' (to boast) or other figurative senses."}
{"guid": "N02_027", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "eagle", "concept_definition": "A large bird of prey with a hooked beak and strong talons, known for keen eyesight and powerful flight.", "difficulty_level": 15, "notes": "Primary sense: the bird of prey. Lithuanian 'erelis' is standard masculine singular; 'erelė' can be used for a female eagle. All translations are base singular nouns."}
{"guid": "N02_028", "pos_type": "noun", "pos_subtype": "animal", "concept_label": "sheep", "concept_definition": "A domesticated, woolly mammal kept by humans for its wool, meat, and milk; refers to an individual of the species (Ovis aries).", "difficulty_level": 15, "notes": "Lithuanian 'avis' specifically denotes a sheep (Ovis aries). Alternative Lithuanian dialectal or less common terms may exist; provided alternative 'kovas' is rare/archaic—use 'avis'. Ensure translations are singular base forms."}
